sentinel_model/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type fixedFluxPressure;
        value $internalField;
    }

    "outlet|left|right|up|down"
    {
        //type fixedValue;
        //value uniform 0;
    	type totalPressure;
    	p0 $internalField;
    	value $internalField;

        U U.air;
        phi phi.air;
    }

    walls
    {
        type fixedFluxPressure;
        value $internalField;
    }
}


// ************************************************************************* //
