sentinel_model/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
scale   1;

xl -0.15;
xu 0.15;
yl -0.12;
yu 0.25;
zl -0.163;
zu 0.12;

vertices
(
    ( $xl  $yl  $zl)
    ($xu  $yl  $zl)
    ($xu  $yu  $zl)
    ( $xl  $yu  $zl)
    ( $xl  $yl  $zu)
    ($xu  $yl  $zu)
    ($xu  $yu  $zu)
    ( $xl  $yu  $zu)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (38 46 35) 
    simpleGrading 
    (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    up
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }

    down
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    inlet
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
